<?php
//--------------------------------------------------------//System
$C_TextCaps = 'QWERTYUIOPASDFGHJKLZXCVBNM';
$C_TextDown = 'qwertyuiopasdfghjklzxcvbnm';
$C_Numberic = '0123456789';
//--------------------------------------------------------Server
$Max_worket_time = 60*60*24*7;                            //—колько максимум может обработать скрипт-крон за 1 раз в сек
$Disable_login = false;                                   //«апретить авторизацию зарегистрированным пользовател€м - дл€ проведени€ тех работ
$Disable_login_message = '¬едутс€ технические работы.';   //“екст сообщени€ при попытке авторизоватьс€
$EnableBanList = false;                                   //«апрет авторизовыватьс€ списку игроков. (Ќе закрывает сессию)
$BanList = array("as", "admin");                          //“от самый список пользователей
//--------------------------------------------------------Global
$ebableRegistration = true;                               //–азрешить регистрацию
$SpeedMission       = 2;                                  //скорость миссии в соседнюю клетку
$Addtime            = 3;                                  //минимальное врем€ миссии (прибавл€етс€ ко времени, насчитанном из пункта выше)
$Lang_session       = 60*60*2;                            //ћаксимальна€ длина сессии.
                                                          //ѕри превышении времени - выкидывает игрока на страницу авторизации
$Max_X_map          = 100;                                //–азмеры карты
$Max_Y_map          = 70;
$AverageCountLager  = 5;                                  //—реднее количество лагерей на 1 королевство 25*5=125
//--------------------------------------------------------GAME
$Max_level_HAUS = 50;
$Max_Player_Mission = 400;                                //ћаксимальное колличество миссий на 1 игрока
//--------------------------------------------------------COST
$Cost_work_money_speed = 7;                               //—тоимость платной постройки комнаты
//---------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------
if ($MaxTimeWorkCron >= 26)
    $MaxTimeWorkCron = 26;
?>